import React, {Component} from 'react';
import {Card, Image} from "react-bootstrap";


class Postfirst extends Component {
    render() {
        return (
            <div>
                <Image
                    className="mx-auto d-block"
                    width={350}
                    height={350}
                    src="https://donpion.ua/static/media/uploads/product/One_flower/rose-import/kahala/.thumbnails/kahala_.jpg/kahala_-0x700.jpg"
                />
                <Card className="m-4 text-center" bg="light" border="primary">
                    <Card.Body>
                        <Card.Title>ТРОЯНДА КАХАЛА</Card.Title>
                        <Card.Text>
                            Троянда Кахала - півоновидна троянда, яка заробила у тих хто дарує і отримує квіти в
                            подарунок - високу репутацію. Розу Кахала часто порівнюють з балетною примою - у неї пишна
                            пачка і витончена ніжка. Як примхлива дівчина, так і даний сорт троянд дуже чутливий.
                            Вирощують троянду Кахала виключно в розплідниках, тому що цей сорт троянд дуже вибагливий
                            і навіть найменше відхилення флори і середовища від норми несе смерть для розкішної
                            персикової квітки. Рослина має назву на честь найбільш благополучного району Гаваї. Флористи
                            відзначають особливий відтінок троянд Кахала. Сорт славиться двобарвними квітами -
                            ніжна вуаль дорогого шампанського плавно перетікає в насичено-помаранчевий. Через щільності
                            махрових бутонів троянди відносять до півоновидної групи. Пелюсток дуже багато.
                            Вони оксамитові і свіжого персикового відтінку. Саме завдяки унікальному кольору,
                            троянда особливо цінується у флористів. Бутони великі, аромату не мають. Вони розташовуються
                            на верхівках стебел (висотою до 40-90 см) з шипами. У флористів вважається, що
                            букет з трояндою Кахала символізує міцну дружбу. Тому, їх найчастіше дарують на дні
                            народження, і по іншим знаменним датам друзям і близьким людям. Привабливий вигляд троянд
                            Кахала дозволяє використовувати їх і для оформлення інтер'єру. Барвисті композиції за участю
                            цих дивовижних троянд вигідно прикрасять затишний інтер'єр будинку або офісу. Квіти
                            прекрасно виглядають в невисокій, прозорій вазі. Троянда Кахала ніжна і чуттєва квітка,
                            але при регулярній зміні води на чисту - квітка довше збереже свою первозданну свіжість.
                            <p>Джерело: https://donpion.ua/shop/product/rose-varieties-kahala/</p>
                        </Card.Text>
                    </Card.Body>
                </Card>
            </div>
        );
    }
}

export default Postfirst;